Autodesk.Revit.DB.IFC.IFCExportCategoryMappingInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCExportCategoryMappingInfo.IFCPredefinedType
The name of the predefined type mapped to a particular Revit category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFC.IFCExportCategoryMappingInfo.IFCEntityName
The name of the IFC entity mapped to a particular Revit category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFC.IFCExportCategoryMappingInfo.#ctor(System.String,System.String)
Constructs an IFCExportCategoryMappingInfo with an entity name and a predefined type.
entityName:
The IFC entity name.
predefinedType:
The corresponding IFC predefined type, if any.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFC.IFCExportCategoryMappingInfo.#ctor
The default IFCExportCategoryMappingInfo constructor.
Since:
2025

Autodesk.Revit.DB.IFC.IFCExportCategoryMappingInfo
The information associated with a particular category in the IFCExportCategoryMappingTable.
Since:
2025